In [2]:
import sys
import pandas as pd
from pandas.io import sql
from pandas.io.sql import read_sql
from pandas.io.sql import to_sql

#sqlalchemy
from sqlalchemy import create_engine, Table, Column, Integer, String, MetaData, ForeignKey

# for postgres
import psycopg2

import warnings
warnings.filterwarnings("ignore")

print('OK')

OK

In [18]:
#creates connection that allows creating a DB

engine = psycopg2.connect(dbname='postgres',
      user='timbroderick', host='localhost')

from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT

engine.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT)

cur = engine.cursor()

# run sql command to create new db

cur.execute("CREATE DATABASE %s ;" % 'pyanalysis')

cur.close()
engine.close()

# connection closed

print('done')

ready

In [3]:
# open a new connection to pyanalysis
engine = create_engine('postgresql://postgres@localhost:5432/pyanalysis')
print("OK")

OK

In [4]:
# drop table if it exists
engine.execute("DROP TABLE IF EXISTS teachers")

# add new table
engine.execute("CREATE TABLE teachers ("
            "id bigserial,"
            "first_name varchar(25),"
            "last_name varchar(50),"
            "school varchar(50),"
            "hire_date date,"
            "salary numeric"
            ")" ) # no semicolon at end of commands here
print('done')

done

In [6]:
# select only the public tables, or tables I created, from pyanalysis
sql = "SELECT table_name FROM information_schema.tables WHERE table_schema='public'"
names = pd.read_sql(sql, engine)
names.head(30)

  table_name
0   teachers

In [9]:
# now let's add data to the table
# this series of commands needs to be run in sequence
engine.execute("INSERT INTO teachers (first_name, last_name, school, hire_date, salary)"
               "VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),"
               "('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),"
               "('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),"
               "('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),"
               "('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),"
               "('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500)" )

# Tests to see if it's there
sql = "SELECT * FROM teachers"
teachers = pd.read_sql(sql, engine)
teachers.head(5)

   id first_name last_name               school   hire_date   salary
0   1      Janet     Smith    F.D. Roosevelt HS  2011-10-30  36200.0
1   2        Lee  Reynolds    F.D. Roosevelt HS  1993-05-22  65000.0
2   3     Samuel      Cole  Myers Middle School  2005-08-01  43500.0
3   4   Samantha      Bush  Myers Middle School  2011-10-30  36200.0
4   5      Betty      Diaz  Myers Middle School  2005-08-30  43500.0

In [11]:
# read with dates parsed

sql = "SELECT * FROM teachers"
teachers = pd.read_sql(sql, engine, parse_dates=['hire_date'])

print(teachers.dtypes)

teachers.head(5)

id                     int64
first_name            object
last_name             object
school                object
hire_date     datetime64[ns]
salary               float64
dtype: object

   id first_name last_name               school  hire_date   salary
0   1      Janet     Smith    F.D. Roosevelt HS 2011-10-30  36200.0
1   2        Lee  Reynolds    F.D. Roosevelt HS 1993-05-22  65000.0
2   3     Samuel      Cole  Myers Middle School 2005-08-01  43500.0
3   4   Samantha      Bush  Myers Middle School 2011-10-30  36200.0
4   5      Betty      Diaz  Myers Middle School 2005-08-30  43500.0

In [ ]:
# end chapter 1